submission_logs/2_2_two_middlewares/64/8/1-0/1/memtier/3.log
1         Threads
8         Connections per thread
80        Seconds


ALL STATS
========================================================================
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec 
------------------------------------------------------------------------
Sets        2041.16          ---          ---      3.86800      8245.15 
Gets           0.00         0.00         0.00      0.00000         0.00 
Waits          0.00          ---          ---      0.00000          --- 
Totals      2041.16         0.00         0.00      3.86800      8245.15 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.490         0.00
SET       0.520         0.00
SET       0.530         0.00
SET       0.550         0.00
SET       0.570         0.00
SET       0.580         0.01
SET       0.590         0.01
SET       0.600         0.01
SET       0.610         0.02
SET       0.620         0.02
SET       0.630         0.04
SET       0.640         0.05
SET       0.650         0.06
SET       0.660         0.08
SET       0.670         0.11
SET       0.680         0.13
SET       0.690         0.16
SET       0.700         0.19
SET       0.710         0.22
SET       0.720         0.26
SET       0.730         0.31
SET       0.740         0.38
SET       0.750         0.45
SET       0.760         0.50
SET       0.770         0.57
SET       0.780         0.65
SET       0.790         0.73
SET       0.800         0.84
SET       0.810         0.95
SET       0.820         1.07
SET       0.830         1.18
SET       0.840         1.32
SET       0.850         1.46
SET       0.860         1.62
SET       0.870         1.78
SET       0.880         1.97
SET       0.890         2.17
SET       0.900         2.38
SET       0.910         2.62
SET       0.920         2.85
SET       0.930         3.08
SET       0.940         3.34
SET       0.950         3.63
SET       0.960         3.89
SET       0.970         4.21
SET       0.980         4.51
SET       0.990         4.83
SET       1.000         6.88
SET       1.100        11.28
SET       1.200        16.62
SET       1.300        22.50
SET       1.400        28.53
SET       1.500        34.47
SET       1.600        40.05
SET       1.700        45.13
SET       1.800        49.42
SET       1.900        52.98
SET       2.000        56.05
SET       2.100        58.48
SET       2.200        60.51
SET       2.300        62.15
SET       2.400        63.50
SET       2.500        64.56
SET       2.600        65.47
SET       2.700        66.22
SET       2.800        66.86
SET       2.900        67.38
SET       3.000        67.88
SET       3.100        68.33
SET       3.200        68.73
SET       3.300        69.06
SET       3.400        69.36
SET       3.500        69.63
SET       3.600        69.86
SET       3.700        70.06
SET       3.800        70.23
SET       3.900        70.42
SET       4.000        70.58
SET       4.100        70.73
SET       4.200        70.87
SET       4.300        71.00
SET       4.400        71.14
SET       4.500        71.25
SET       4.600        71.37
SET       4.700        71.49
SET       4.800        71.59
SET       4.900        71.68
SET       5.000        71.77
SET       5.100        71.86
SET       5.200        71.95
SET       5.300        72.01
SET       5.400        72.07
SET       5.500        72.14
SET       5.600        72.21
SET       5.700        72.26
SET       5.800        72.35
SET       5.900        72.42
SET       6.000        72.51
SET       6.100        72.58
SET       6.200        72.66
SET       6.300        72.74
SET       6.400        72.84
SET       6.500        72.92
SET       6.600        73.04
SET       6.700        73.16
SET       6.800        73.31
SET       6.900        73.51
SET       7.000        73.77
SET       7.100        74.06
SET       7.200        74.42
SET       7.300        74.86
SET       7.400        75.46
SET       7.500        76.18
SET       7.600        77.06
SET       7.700        78.02
SET       7.800        79.11
SET       7.900        80.31
SET       8.000        81.59
SET       8.100        82.97
SET       8.200        84.41
SET       8.300        85.86
SET       8.400        87.25
SET       8.500        88.68
SET       8.600        90.04
SET       8.700        91.21
SET       8.800        92.32
SET       8.900        93.39
SET       9.000        94.23
SET       9.100        94.95
SET       9.200        95.61
SET       9.300        96.11
SET       9.400        96.55
SET       9.500        96.94
SET       9.600        97.28
SET       9.700        97.54
SET       9.800        97.76
SET       9.900        97.97
SET      10.000        98.72
SET      11.000        99.26
SET      12.000        99.56
SET      13.000        99.68
SET      14.000        99.75
SET      15.000        99.80
SET      16.000        99.81
SET      17.000        99.84
SET      18.000        99.87
SET      19.000        99.90
SET      20.000        99.90
SET      21.000        99.91
SET      24.000        99.91
SET      25.000        99.91
SET      26.000        99.91
SET      27.000        99.91
SET      28.000        99.91
SET      32.000        99.92
SET      37.000        99.92
SET      46.000        99.92
SET      48.000        99.92
SET      51.000        99.92
SET      52.000        99.92
SET      59.000        99.92
SET      60.000        99.92
SET      62.000        99.92
SET      64.000        99.92
SET      67.000        99.92
SET      71.000        99.92
SET      75.000        99.92
SET      76.000        99.93
SET      79.000        99.93
SET      81.000        99.93
SET      82.000        99.93
SET      84.000        99.93
SET      85.000        99.93
SET      86.000        99.93
SET      87.000        99.93
SET      88.000        99.93
SET      89.000        99.94
SET      90.000        99.94
SET      91.000        99.94
SET      92.000        99.94
SET      93.000        99.94
SET      94.000        99.94
SET      95.000        99.94
SET      96.000        99.94
SET      97.000        99.95
SET      98.000        99.95
SET     100.000        99.95
SET     110.000        99.95
SET     120.000        99.95
SET     130.000        99.95
SET     140.000        99.95
SET     160.000        99.96
SET     170.000        99.96
SET     180.000        99.96
SET     190.000        99.96
SET     200.000        99.97
SET     240.000        99.97
SET     250.000        99.97
SET     300.000        99.97
SET     340.000        99.97
SET     360.000        99.97
SET     420.000        99.97
SET     430.000        99.97
SET     440.000        99.97
SET     450.000        99.98
SET     470.000        99.98
SET     490.000        99.98
SET     520.000        99.98
SET     540.000        99.98
SET     550.000        99.98
SET     560.000        99.99
SET     570.000        99.99
SET     580.000        99.99
SET     600.000        99.99
SET     610.000        99.99
SET     630.000        99.99
SET     650.000        99.99
SET     700.000        99.99
SET     720.000        99.99
SET     740.000       100.00
SET     760.000       100.00
SET     780.000       100.00
SET     790.000       100.00
SET     810.000       100.00
SET    1400.000       100.00
SET    1600.000       100.00
---
---